spec/cassettes/Create_payment_on_successful_charge/create_a_payment_associated_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15yaHOHm1LsTwnnZVrYYmgRo
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_N3kN90bAJxy1fhanixorOQ1v
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.0.0 p598 (2014-11-13)","platform":"x86_64-darwin14.0.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        DanielTseng.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05
        PDT 2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64","hostname":"DanielTseng.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 04 May 2015 06:10:16 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2647'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - '*'
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_tdqdHM8LjBmCZSkb
      Stripe-Version:
      - '2014-08-04'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15yaHOHm1LsTwnnZVrYYmgRo",
          "created": 1430710202,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_15yaHNHm1LsTwnnZjdxkuFMI",
              "object": "charge",
              "created": 1430710201,
              "livemode": false,
              "paid": true,
              "status": "paid",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_15yaHMHm1LsTwnnZddS4Yifx",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2020,
                "fingerprint": "NfoheIZ05iYLkqY4",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6Aw9Y4gVNUhJFk"
              },
              "captured": true,
              "card": {
                "id": "card_15yaHMHm1LsTwnnZddS4Yifx",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2020,
                "fingerprint": "NfoheIZ05iYLkqY4",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6Aw9Y4gVNUhJFk"
              },
              "balance_transaction": "txn_15yaHNHm1LsTwnnZL10LcWJP",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_6Aw9Y4gVNUhJFk",
              "invoice": "in_15yaHNHm1LsTwnnZyQZnCuGm",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": null,
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15yaHNHm1LsTwnnZjdxkuFMI/refunds",
                "data": []
              },
              "statement_description": null
            }
          },
          "object": "event",
          "pending_webhooks": 1,
          "request": "iar_6Aw9qacQYwFhyJ",
          "api_version": "2014-08-04"
        }
    http_version: 
  recorded_at: Mon, 04 May 2015 06:10:17 GMT
recorded_with: VCR 2.9.3
